#tap "adoptopenjdk/openjdk"
#tap "homebrew/bundle"
#tap "homebrew/services"
#tap "koekeishiya/formulae"
#tap "wix/brew"
#tap "alienator88/cask"
#tap "grishka/grishka"
#tap "jesseduffield/lazydocker"
#tap "localsend/localsend"
#tap "playcover/playcover"
#tap "schappim/ocr"
cask_args appdir: "/Applications"
brew "ack"
brew "eza"
brew "awscli"
brew "bat"
brew "chruby"
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "moreutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "direnv"
brew "ffmpeg"
brew "lsd"
brew "fzf"
brew "git"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "mas"
brew "neovim"
brew "node"
brew "python"
brew "pyenv"
brew "rsync"
brew "ruby-install"
brew "rust"
brew "starship"
brew "stow"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"
brew "xz"
brew "ansible"
brew "dua-cli"
brew "tesseract"
brew "git-lfs"
brew "go"
brew "hugo"
brew "kubernetes-cli"
brew "localstack"
brew "minikube"
brew "ollama"
brew "pnpm"
brew "telnet"
brew "tfenv"
brew "yadm"
brew "zsh-completions"
brew "jesseduffield/lazydocker/lazydocker"
cask "temurin@11"
cask "dozer"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea-ce"
cask "notion"
cask "miniconda"
cask "obsidian"
cask "postman"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "zoom"
cask "appcleaner"
cask "obs"
cask "docker"
cask "raycast"
cask "rectangle"
cask "iterm2"
cask "jellyfin-media-player"
cask "keycastr"
cask "maccy"
cask "vlc"
cask "microsoft-remote-desktop"
cask "cheatsheet"
cask "sublime-text"
cask "discord"
cask "figma"
cask "whisky"
cask "utm"
cask "pearcleaner"
cask "devtoys"
cask "keepassxc"
cask "keka"
cask "cyberduck"
cask "cron"
cask "colorpicker-propicker"
cask "betterdisplay"
cask "alt-tab"
cask "asana"
#cask "bartender"
#cask "topnotch"
