tap "sdkman/tap"
tap "localstack/tap"

cask_args appdir: "/Applications"

# --- Core CLI tools ----------------------------------------------------------
brew "git"
brew "git-delta"          # beautiful git diffs
brew "git-lfs"            # large file support
brew "gh"                 # GitHub CLI
brew "curl"
brew "wget"
brew "rsync"              # file sync
brew "stow"               # symlink manager for dotfiles
brew "direnv"             # per-directory env vars
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "ripgrep"            # fast grep (rg)
brew "fd"                 # fast find
brew "bat"                # cat with syntax highlighting
brew "eza"                # modern ls replacement
brew "zoxide"             # smarter cd (z)
brew "htop"
brew "tree"
brew "tldr"               # simplified man pages
brew "tmux"
brew "opencode"
brew "xz"                 # compression
brew "unrar"              # required for extract function (.rar)
brew "sevenzip"           # required for extract function (.7z)
brew "mas"                # Mac App Store CLI
brew "pass"
brew "fzf"
brew "fzf-tab"

# --- Shell -------------------------------------------------------------------
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "you-should-use"
brew "starship"

# --- Dev utilities -----------------------------------------------------------
brew "curlie"             # friendly curl alternative
brew "mkcert"             # local TLS certs
cask "ngrok"              # tunnel localhost
brew "neovim"             # modern vim
brew "lazygit"
brew "asciinema"

# --- Fonts (for terminal / editor) -------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# --- Python ------------------------------------------------------------------
brew "uv"

# --- Java / JVM --------------------------------------------------------------
brew "sdkman/tap/sdkman-cli"         # manage Java, Gradle, Maven versions
# Note: install JDKs via: sdk install java 21-tem

# --- Node / JS ---------------------------------------------------------------
brew "nvm"                # manage Node versions
brew "yarn"
brew "pnpm"

# --- Data science / ML -------------------------------------------------------
brew "duckdb"             # fast local analytics
brew "apache-spark"       # big-data processing

# --- Infrastructure / DevOps -------------------------------------------------
brew "awscli"             # AWS CLI
brew "ansible"            # config management / VPS provisioning
brew "tenv"               # replaces tfenv — manages Terraform + OpenTofu versions
brew "localstack/tap/localstack-cli"     # local AWS emulation

# --- Kubernetes --------------------------------------------------------------
brew "kubernetes-cli"     # kubectl
brew "k3d"                # local K8s via Docker (replaces minikube — faster, lighter)
brew "helm"               # K8s package manager — essential
brew "kubectx"            # switch clusters (kubectx) and namespaces (kubens)
brew "stern"              # multi-pod log tailing
brew "k9s"                # terminal UI for K8s clusters

# --- GUI apps ----------------------------------------------------------------

# --- Remote Access Windows --- #
cask "windows-app"

# --- Google Apps --- #
cask "google-chrome"
cask "google-drive"

# --- Browsers --- #
cask "zen"
cask "helium-browser"

# --- IDEs --- #
cask "visual-studio-code"
cask "intellij-idea"

# --- DB Viewer --- #
cask "dbeaver-community"
cask "db-browser-for-sqlite"

# --- API Client --- #
cask "requestly"
cask "postman"

# --- Terminal --- #
cask "wezterm"
cask "iterm2"
cask "ghostty"

# --- Git Viewer --- #
cask "github"
cask "fork"

# --- Notes Taking --- #
cask "notion"
cask "obsidian"

# --- Communications --- #
cask "discord"
cask "zoom"

# --- Media --- #
cask "vlc"
cask "jellyfin-media-player"

# --- Dev Tools --- #
cask "docker-desktop"
cask "cyberduck"

# --- Archive Tools --- #
cask "the-unarchiver"
cask "keka"

# --- App Cleaner --- #
cask "appcleaner"

# --- Office --- #
cask "citrix-workspace"

# --- System Apps --- #
cask "betterdisplay"
cask "keycastr"             
cask "shottr"               # screenshot replacement
cask "rectangle"            # window manager
cask "raycast"              # spotlight replacement
cask "karabiner-elements"   # keybinder
cask "maccy"                # clipboard manager

# Mac App Store
mas "Yoink - Better Drag and Drop", id: 457622435
