tap "adoptopenjdk/openjdk"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

cask_args appdir: "/Applications"

brew "ack"
brew "awscli"
brew "bat"
brew "chruby"
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "moreutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "direnv"
brew "ffmpeg"
brew "lsd"
brew "fzf"
brew "git"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "mas"
brew "neovim"
brew "node"
brew "obsidian"
brew "python"
brew "pyenv"
brew "rsync"
brew "ruby-install"
brew "rust"
brew "starship"
brew "stow"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"

cask "adoptopenjdk11"
cask "adoptopenjdk11-jre"
cask "dozer"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "istat-menus"
cask "miniconda"
cask "obsidian"
cask "postman"
cask "slack"
cask "spotify"
cask "syncthing"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "zoom"
cask "appcleaner"
cask "obs"
cask "docker"
cask "protonvpn"
cask "font-jetbrains-mono-nerd-font"
cask "raycast"
cask "rectangle"
cask "google-drive"
cask "iterm2"
cask "jellyfin-media-player"
cask "keycastr"
cask "maccy"
cask "vlc"
cask "microsoft-remote-desktop"
